In [1]:
import pandas as pd
from sqlalchemy import create_engine

In [50]:
import pymysql
con = pymysql.connect(host='localhost',user='root',password='campusx',database='task_36')

In [23]:
insurance=pd.read_csv("insurance.csv")
insurance

,index,PatientID,age,gender,bmi,bloodpressure,diabetic,children,smoker,region,claim
0,0,1,39.0,male,23.2,91,Yes,0,No,southeast,1121.87
1,1,2,24.0,male,30.1,87,No,0,No,southeast,1131.51
2,2,3,NaN,male,33.3,82,Yes,0,No,southeast,1135.94
3,3,4,NaN,male,33.7,80,No,0,No,northwest,1136.40
4,4,5,NaN,male,34.1,100,No,0,No,northwest,1137.01
...,...,...,...,...,...,...,...,...,...,...,...
1335,1335,1336,44.0,female,35.5,88,Yes,0,Yes,northwest,55135.40
1336,1336,1337,59.0,female,38.1,120,No,1,Yes,northeast,58571.07
1337,1337,1338,30.0,male,34.5,91,Yes,3,Yes,northwest,60021.40
1338,1338,1339,37.0,male,30.4,106,No,0,Yes,southeast,62592.87
1339,1339,1340,30.0,female,47.4,101,No,0,Yes,southeast,63770.43

In [41]:
engine = create_engine("mysql+pymysql://root:campusx@localhost/task_36")
insurance.to_sql("insurance", con=engine)

1340

**Note: Try to avoid *GROUP BY* clause to solve the problems**

For the problems use the *Health Insurance Claim* dataset. You can get the details as well as the dataset from [here](https://www.kaggle.com/datasets/thedevastator/insurance-claim-analysis-demographic-and-health).

### **Problem 1:** What are the top 5 patients who claimed the highest insurance amounts?

### **Problem 2:** What is the average insurance claimed by patients based on the number of children they have?

### **Problem 3:** What is the highest and lowest claimed amount by patients in each region?

### **Problem 4:** What is the percentage of smokers in each age group?

### **Problem 5:** What is the difference between the claimed amount of each patient and the first claimed amount of that patient?

### **Problem 6:** For each patient, calculate the difference between their claimed amount and the average claimed amount of patients with the same number of children.

### **Problem 7:** Show the patient with the highest BMI in each region and their respective rank.

### **Problem 8:** Calculate the difference between the claimed amount of each patient and the claimed amount of the patient who has the highest BMI in their region.

### **Problem 9:** For each patient, calculate the difference in claim amount between the patient and the patient with the highest claim amount among patients with the same bmi and smoker status, within the same region. Return the result in descending order difference.

### **Problem 10:** For each patient, find the maximum BMI value among their next three records (ordered by age).

### **Problem 11:** For each patient, find the rolling average of the last 2 claims.

### **Problem 12:** Find the first claimed insurance value for male and female patients, within each region order the data by patient age in ascending order, and only include patients who are non-diabetic and have a bmi value between 25 and 30.

### **Problem 1:** What are the top 5 patients who claimed the highest insurance amounts?

In [26]:
#WITH Window function

import pymysql
import pandas as pd

# Establish a connection to the database
conn = pymysql.connect(host='localhost', user='root', password='campusx', database='task_36')

# Define the SQL query
query = """
  SELECT PatientID, claim
  FROM (
    SELECT PatientID, claim, ROW_NUMBER() OVER (ORDER BY claim DESC) AS row_num
    FROM insurance
  ) t
  WHERE row_num <= 5
"""

# Execute the query and read the results into a DataFrame
df = pd.read_sql(query, conn)

# Print the DataFrame
print(df)

   PatientID     claim
0       1340  63770.43
1       1339  62592.87
2       1338  60021.40
3       1337  58571.07
4       1336  55135.40

C:\Users\Administrator\AppData\Local\Programs\Python\Python310\lib\site-packages\pandas\io\sql.py:761: UserWarning: pandas only support SQLAlchemy connectable(engine/connection) ordatabase string URI or sqlite3 DBAPI2 connectionother DBAPI2 objects are not tested, please consider using SQLAlchemy
  warnings.warn(

In [25]:
#WITHOUT Window function

import pymysql
import pandas as pd

# Establish a connection to the database
conn = pymysql.connect(host='localhost', user='root', password='campusx', database='task_36')

# Define the SQL query
query = "SELECT PatientID, claim FROM insurance ORDER BY claim DESC LIMIT 5"

# Execute the query and read the results into a DataFrame
df = pd.read_sql(query, conn)

# Print the DataFrame
print(df)

   PatientID     claim
0       1340  63770.43
1       1339  62592.87
2       1338  60021.40
3       1337  58571.07
4       1336  55135.40

### **Problem 2:** What is the average insurance claimed by patients based on the number of children they have?

In [27]:
#WITH Window function

import pymysql
import pandas as pd

# Establish a connection to the database
conn = pymysql.connect(host='localhost', user='root', password='campusx', database='task_36')

# Define the SQL query
query = """
  SELECT children, AVG(claim) AS avg_claim
  FROM (
    SELECT children, claim, ROW_NUMBER() OVER (PARTITION BY children ORDER BY claim DESC) AS row_num
    FROM insurance
  ) t
  WHERE row_num = 1
  GROUP BY children
"""

# Execute the query and read the results into a DataFrame
df = pd.read_sql(query, conn)

# Print the DataFrame
print(df)

   children  avg_claim
0         0   63770.43
1         1   58571.07
2         2   49577.66
3         3   60021.40
4         4   40182.25
5         5   19023.26

C:\Users\Administrator\AppData\Local\Programs\Python\Python310\lib\site-packages\pandas\io\sql.py:761: UserWarning: pandas only support SQLAlchemy connectable(engine/connection) ordatabase string URI or sqlite3 DBAPI2 connectionother DBAPI2 objects are not tested, please consider using SQLAlchemy
  warnings.warn(

### **Problem 3:** What is the highest and lowest claimed amount by patients in each region?

In [29]:
import pandas as pd
import pymysql

# establish connection to database
con = pymysql.connect(host='localhost', user='root', password='campusx', database='task_35')

# define SQL query
query = """
SELECT region, MAX(claim) AS max_claim, MIN(claim) AS min_claim
FROM (
  SELECT region, claim,
    ROW_NUMBER() OVER (PARTITION BY region ORDER BY claim DESC) AS rank_max,
    ROW_NUMBER() OVER (PARTITION BY region ORDER BY claim ASC) AS rank_min
  FROM insurance
) subquery
WHERE rank_max = 1 OR rank_min = 1
GROUP BY region;
"""

# execute query and store results in a pandas dataframe
df = pd.read_sql_query(query, con)

# print dataframe
print(df)

      region  max_claim  min_claim
0       None    1256.30    1252.41
1  northeast   58571.07    1694.80
2  northwest   60021.40    1136.40
3  southeast   63770.43    1121.87
4  southwest   52590.83    1261.44

C:\Users\Administrator\AppData\Local\Programs\Python\Python310\lib\site-packages\pandas\io\sql.py:761: UserWarning: pandas only support SQLAlchemy connectable(engine/connection) ordatabase string URI or sqlite3 DBAPI2 connectionother DBAPI2 objects are not tested, please consider using SQLAlchemy
  warnings.warn(

### **Problem 4:** What is the percentage of smokers in each age group?

In [31]:
import pymysql
import pandas as pd

# connect to the database
con = pymysql.connect(host='localhost', user='root', password='campusx', database='task_36')

# define the SQL query
query = """
SELECT age,
       smoker,
       COUNT(*) OVER (PARTITION BY age, smoker) AS total_patients,
       SUM(CASE WHEN smoker = 'yes' THEN 1 ELSE 0 END) OVER (PARTITION BY age) AS smoker_patients,
       (SUM(CASE WHEN smoker = 'yes' THEN 1 ELSE 0 END) OVER (PARTITION BY age, smoker) / COUNT(*) OVER (PARTITION BY age, smoker) * 100) AS smoker_percentage
FROM insurance;
"""

# execute the query and fetch the results
result = pd.read_sql_query(query, con)

# print the results
print(result)

       age smoker  total_patients  smoker_patients  smoker_percentage
0      NaN     No               5              0.0                0.0
1      NaN     No               5              0.0                0.0
2      NaN     No               5              0.0                0.0
3      NaN     No               5              0.0                0.0
4      NaN     No               5              0.0                0.0
...    ...    ...             ...              ...                ...
1335  60.0    Yes               5              5.0              100.0
1336  60.0    Yes               5              5.0              100.0
1337  60.0    Yes               5              5.0              100.0
1338  60.0    Yes               5              5.0              100.0
1339  60.0    Yes               5              5.0              100.0

[1340 rows x 5 columns]

### **Problem 5:** What is the difference between the claimed amount of each patient and the first claimed amount of that patient?

In [44]:
import pymysql
import pandas as pd

# establish a connection to the database
con = pymysql.connect(host='localhost', user='root', password='campusx', database='task_36')

# define the SQL query
sql_query = """
SELECT PatientID, claim, 
       LEAD(claim) OVER (PARTITION BY PatientID ORDER BY claim) - claim AS claim_diff
FROM insurance
ORDER BY PatientID;

"""

# execute the query using pandas and the established connection
df = pd.read_sql_query(sql_query, con)

# print the resulting dataframe
print(df)

      PatientID     claim claim_diff
0             1   1121.87       None
1             2   1131.51       None
2             3   1135.94       None
3             4   1136.40       None
4             5   1137.01       None
...         ...       ...        ...
1335       1336  55135.40       None
1336       1337  58571.07       None
1337       1338  60021.40       None
1338       1339  62592.87       None
1339       1340  63770.43       None

[1340 rows x 3 columns]

C:\Users\Administrator\AppData\Local\Programs\Python\Python310\lib\site-packages\pandas\io\sql.py:761: UserWarning: pandas only support SQLAlchemy connectable(engine/connection) ordatabase string URI or sqlite3 DBAPI2 connectionother DBAPI2 objects are not tested, please consider using SQLAlchemy
  warnings.warn(

In [36]:
print(insurance.isnull().sum())

index            0
PatientID        0
age              5
gender           0
bmi              0
bloodpressure    0
diabetic         0
children         0
smoker           0
region           3
claim            0
dtype: int64

In [38]:
#in age 5 missing values and region 3 missing values is there so i revomed missing values using this code
insurance['age'] = insurance['age'].fillna(insurance['age'].mean())
insurance['region'] = insurance['region'].fillna(insurance['region'].mode()[0])

In [39]:
insurance

,index,PatientID,age,gender,bmi,bloodpressure,diabetic,children,smoker,region,claim
0,0,1,39.000000,male,23.2,91,Yes,0,No,southeast,1121.87
1,1,2,24.000000,male,30.1,87,No,0,No,southeast,1131.51
2,2,3,38.078652,male,33.3,82,Yes,0,No,southeast,1135.94
3,3,4,38.078652,male,33.7,80,No,0,No,northwest,1136.40
4,4,5,38.078652,male,34.1,100,No,0,No,northwest,1137.01
...,...,...,...,...,...,...,...,...,...,...,...
1335,1335,1336,44.000000,female,35.5,88,Yes,0,Yes,northwest,55135.40
1336,1336,1337,59.000000,female,38.1,120,No,1,Yes,northeast,58571.07
1337,1337,1338,30.000000,male,34.5,91,Yes,3,Yes,northwest,60021.40
1338,1338,1339,37.000000,male,30.4,106,No,0,Yes,southeast,62592.87
1339,1339,1340,30.000000,female,47.4,101,No,0,Yes,southeast,63770.43

In [40]:
print(insurance.isnull().sum())

index            0
PatientID        0
age              0
gender           0
bmi              0
bloodpressure    0
diabetic         0
children         0
smoker           0
region           0
claim            0
dtype: int64

### **Problem 6:** For each patient, calculate the difference between their claimed amount and the average claimed amount of patients with the same number of children.

In [69]:
#WITH Window function getting different answer

# import pymysql
# import pandas as pd

# # establish a connection to the database
# con = pymysql.connect(host='localhost', user='root', password='password', database='task_36')

# # define the SQL query
# sql_query = """
# SELECT PatientID, claim, 
#        claim - AVG(claim) OVER (PARTITION BY children) AS claim_diff 
# FROM insurance;
# """

# # execute the query using pandas and the established connection
# df = pd.read_sql_query(sql_query, con)

# # print the resulting dataframe
# print(df)

In [47]:
#WITHOUT Window function

import pandas as pd
import pymysql

# establish a connection to the database
con = pymysql.connect(host='localhost', user='root', password='campusx', database='task_36')

# define the SQL query to get the average claimed amount of patients with the same number of children
avg_claim_query = """
SELECT children, AVG(claim) AS avg_claim
FROM insurance
GROUP BY children
"""

# execute the query and store the result in a dataframe
avg_claim_df = pd.read_sql_query(avg_claim_query, con)

# define the SQL query to calculate the difference between the claimed amount of each patient and the average claimed amount
# of patients with the same number of children
diff_claim_query = """
SELECT i.PatientID, i.claim, 
       i.claim - COALESCE(c.avg_claim, 0) AS claim_diff 
FROM insurance AS i
LEFT JOIN (
    SELECT children, AVG(claim) AS avg_claim
    FROM insurance
    GROUP BY children
) AS c
ON i.children = c.children;
"""

# execute the query and store the result in a dataframe
diff_claim_df = pd.read_sql_query(diff_claim_query, con)

# print the resulting dataframe
print(diff_claim_df)

      PatientID     claim    claim_diff
0             1   1121.87 -11206.123160
1             2   1131.51 -11196.483160
2             3   1135.94 -11192.053160
3             4   1136.40 -11191.593160
4             5   1137.01 -11190.983160
...         ...       ...           ...
1335       1336  55135.40  42807.406840
1336       1337  58571.07  45839.898179
1337       1338  60021.40  44666.081465
1338       1339  62592.87  50264.876840
1339       1340  63770.43  51442.436840

[1340 rows x 3 columns]

C:\Users\Administrator\AppData\Local\Programs\Python\Python310\lib\site-packages\pandas\io\sql.py:761: UserWarning: pandas only support SQLAlchemy connectable(engine/connection) ordatabase string URI or sqlite3 DBAPI2 connectionother DBAPI2 objects are not tested, please consider using SQLAlchemy
  warnings.warn(
C:\Users\Administrator\AppData\Local\Programs\Python\Python310\lib\site-packages\pandas\io\sql.py:761: UserWarning: pandas only support SQLAlchemy connectable(engine/connection) ordatabase string URI or sqlite3 DBAPI2 connectionother DBAPI2 objects are not tested, please consider using SQLAlchemy
  warnings.warn(

### **Problem 7:** Show the patient with the highest BMI in each region and their respective rank.

In [53]:
#WITH Window function

import pandas as pd
import pymysql

# establish a connection to the database
con = pymysql.connect(host='localhost', user='root', password='campusx', database='task_36')

# define the SQL query
sql_query = """
SELECT PatientID, region, bmi, 
       RANK() OVER (PARTITION BY region ORDER BY bmi DESC) AS bmi_rank
FROM insurance
WHERE bmi = (SELECT MAX(bmi) FROM insurance i2 WHERE i2.region = insurance.region)
ORDER BY region;

"""

# execute the query using pandas and the established connection
df = pd.read_sql_query(sql_query, con)

# print the resulting dataframe
print(df)

   PatientID     region   bmi  bmi_rank
0        676  northeast  48.1         1
1         10  northwest  53.1         1
2       1300  southeast  52.6         1
3       1307  southwest  47.6         1

### **Problem 8:** Calculate the difference between the claimed amount of each patient and the claimed amount of the patient who has the highest BMI in their region.

In [59]:
#WITHOUT Window function

import pandas as pd
import pymysql

# establish a connection to the database
con = pymysql.connect(host='localhost', user='root', password='campusx', database='task_36')

# define the SQL query
sql_query = """
SELECT i.PatientID, i.region, i.claim, i.bmi, 
       i.claim - r.max_claim_by_region AS claim_diff
FROM insurance i
JOIN (
    SELECT region, MAX(bmi) AS max_bmi, MAX(claim) AS max_claim_by_region
    FROM insurance
    GROUP BY region
) r
ON i.region = r.region AND i.bmi = r.max_bmi
ORDER BY i.PatientID;
"""

# execute the query using pandas and the established connection
df = pd.read_sql_query(sql_query, con)

# print the resulting dataframe
print(df)

   PatientID     region     claim   bmi  claim_diff
0         10  northwest   1163.46  53.1   -58857.94
1        676  northeast   9432.93  48.1   -49138.14
2       1300  southeast  44501.40  52.6   -19269.03
3       1307  southwest  46113.51  47.6    -6477.32

C:\Users\Administrator\AppData\Local\Programs\Python\Python310\lib\site-packages\pandas\io\sql.py:761: UserWarning: pandas only support SQLAlchemy connectable(engine/connection) ordatabase string URI or sqlite3 DBAPI2 connectionother DBAPI2 objects are not tested, please consider using SQLAlchemy
  warnings.warn(

### **Problem 9:** For each patient, calculate the difference in claim amount between the patient and the patient with the highest claim amount among patients with the same bmi and smoker status, within the same region. Return the result in descending order difference.

In [58]:
#WITH Window function

import pandas as pd
import pymysql

# establish a connection to the database
con = pymysql.connect(host='localhost', user='root', password='campusx', database='task_36')

# define the SQL query
sql_query = """
SELECT PatientID, region, bmi, smoker, claim,
       claim - MAX(CASE WHEN claim = max_claim THEN claim END) 
           OVER (PARTITION BY region, bmi, smoker) AS claim_diff
FROM (
    SELECT PatientID, region, bmi, smoker, claim,
           MAX(claim) OVER (PARTITION BY region, bmi, smoker) AS max_claim
    FROM insurance
) t
ORDER BY claim_diff DESC;

"""

# execute the query using pandas and the established connection
df = pd.read_sql_query(sql_query, con)

# print the resulting dataframe
print(df)

      PatientID     region   bmi smoker     claim  claim_diff
0            49  northeast  16.0     No   1694.80        0.00
1           202  northeast  16.8     No   3167.46        0.00
2           974  northeast  17.2    Yes  14455.64        0.00
3           249  northeast  17.3     No   3732.63        0.00
4           895  northeast  17.3    Yes  12829.46        0.00
...         ...        ...   ...    ...       ...         ...
1335        283  southeast  33.3     No   4151.03   -32429.25
1336        240  southwest  34.8     No   3578.00   -33332.61
1337        229  southwest  34.8     No   3443.06   -33467.55
1338         20  southeast  33.3     No   1391.53   -35188.75
1339          3  southeast  33.3     No   1135.94   -35444.34

[1340 rows x 6 columns]

### **Problem 10:** For each patient, find the maximum BMI value among their next three records (ordered by age).

In [65]:
#WITH Window function

import pandas as pd
import pymysql

# establish a connection to the database
con = pymysql.connect(host='localhost', user='root', password='campusx', database='task_36')

# define the SQL query
sql_query = """
SELECT PatientID, age, bmi,
       MAX(bmi) OVER (ORDER BY age ROWS BETWEEN 1 FOLLOWING AND 3 FOLLOWING) AS max_bmi_next3
FROM insurance
ORDER BY PatientID;
"""

# execute the query using pandas and the established connection
df = pd.read_sql_query(sql_query, con)

# print the resulting dataframe
print(df)

      PatientID        age   bmi  max_bmi_next3
0             1  39.000000  23.2           42.1
1             2  24.000000  30.1           37.3
2             3  38.078652  33.3           34.4
3             4  38.078652  33.7           37.3
4             5  38.078652  34.1           37.3
...         ...        ...   ...            ...
1335       1336  44.000000  35.5           23.2
1336       1337  59.000000  38.1           32.1
1337       1338  30.000000  34.5           47.4
1338       1339  37.000000  30.4           31.3
1339       1340  30.000000  47.4           39.5

[1340 rows x 4 columns]

C:\Users\Administrator\AppData\Local\Programs\Python\Python310\lib\site-packages\pandas\io\sql.py:761: UserWarning: pandas only support SQLAlchemy connectable(engine/connection) ordatabase string URI or sqlite3 DBAPI2 connectionother DBAPI2 objects are not tested, please consider using SQLAlchemy
  warnings.warn(

### **Problem 11:** For each patient, find the rolling average of the last 2 claims.

In [67]:
#WITH Window function

import pandas as pd
import pymysql

# establish a connection to the database
con = pymysql.connect(host='localhost', user='root', password='campusx', database='task_36')

# define the SQL query
sql_query = """
SELECT PatientID, claim,
       AVG(claim) OVER (PARTITION BY PatientID ORDER BY age ROWS BETWEEN 2 PRECEDING AND CURRENT ROW) AS rolling_avg
FROM insurance
ORDER BY PatientID, age;

"""

# execute the query using pandas and the established connection
df = pd.read_sql_query(sql_query, con)

# print the resulting dataframe
print(df)

      PatientID     claim  rolling_avg
0             1   1121.87      1121.87
1             2   1131.51      1131.51
2             3   1135.94      1135.94
3             4   1136.40      1136.40
4             5   1137.01      1137.01
...         ...       ...          ...
1335       1336  55135.40     55135.40
1336       1337  58571.07     58571.07
1337       1338  60021.40     60021.40
1338       1339  62592.87     62592.87
1339       1340  63770.43     63770.43

[1340 rows x 3 columns]

C:\Users\Administrator\AppData\Local\Programs\Python\Python310\lib\site-packages\pandas\io\sql.py:761: UserWarning: pandas only support SQLAlchemy connectable(engine/connection) ordatabase string URI or sqlite3 DBAPI2 connectionother DBAPI2 objects are not tested, please consider using SQLAlchemy
  warnings.warn(

### **Problem 12:** Find the first claimed insurance value for male and female patients, within each region order the data by patient age in ascending order, and only include patients who are non-diabetic and have a bmi value between 25 and 30.

In [68]:
#WITH Window function

import pandas as pd
import pymysql

# establish a connection to the database
con = pymysql.connect(host='localhost', user='root', password='campusx', database='task_36')

# define the SQL query
sql_query = """
SELECT PatientID, gender, region, claim, age, bmi, 
       FIRST_VALUE(claim) OVER (PARTITION BY gender, region ORDER BY age ASC) AS first_claim 
FROM insurance 
WHERE diabetic = 'No' AND bmi BETWEEN 25 AND 30
ORDER BY age ASC;

"""

# execute the query using pandas and the established connection
df = pd.read_sql_query(sql_query, con)

# print the resulting dataframe
print(df)

     PatientID  gender     region     claim   age   bmi  first_claim
0         1186    male  northeast  32108.66  18.0  29.7     32108.66
1           42    male  northwest   1635.73  18.0  27.8      1635.73
2          565    male  southeast   7742.11  18.0  26.6      7742.11
3          463    male  southeast   6406.41  18.0  29.8      7742.11
4          660    male  northeast   9222.40  19.0  29.6     32108.66
..         ...     ...        ...       ...   ...   ...          ...
206        211  female  northeast   3213.62  59.0  28.6     10106.13
207       1105  female  northeast  22331.57  60.0  28.1     10106.13
208        325  female  northwest   4571.41  60.0  26.7      4189.11
209       1009  female  southwest  16884.92  60.0  27.9      7050.64
210        351  female  southwest   4883.87  60.0  26.2      7050.64

[211 rows x 7 columns]

C:\Users\Administrator\AppData\Local\Programs\Python\Python310\lib\site-packages\pandas\io\sql.py:761: UserWarning: pandas only support SQLAlchemy connectable(engine/connection) ordatabase string URI or sqlite3 DBAPI2 connectionother DBAPI2 objects are not tested, please consider using SQLAlchemy
  warnings.warn(

## Problem 13-14 : Employee Dataset : https://relational.fit.cvut.cz/dataset/Employee

How to download the dataset

To download the dataset you need to create connection in your mysql workbench 

The datasets are publicly available directly from MariaDB database.

* Open your favourite MariaDB client (MySQL Workbench)
Use following credentials:
```
    hostname: relational.fit.cvut.cz
    port: 3306
    username: guest
    password: relational
```
* Export "employee" database (or other version of the dataset, if available) in your favourite format (e.g. CSV or SQL dump).

In [70]:
import pymysql
con = pymysql.connect(host='relational.fit.cvut.cz',port=int(3306),user='guest',password='relational',database='employee')

In [71]:
#using this code i can fetch data from website server and export every table in csv format directly

import pymysql
import pandas as pd

# Establish a connection to the database
con = pymysql.connect(host='relational.fit.cvut.cz', port=3306, user='guest', password='relational', database='employee')

# Define a function to fetch tables from the database
def fetch_table(table_name):
    query = f'SELECT * FROM {table_name}'
    return pd.read_sql_query(query, con)

# Define a list of table names
table_names = ['departments', 'dept_emp', 'dept_manager', 'employees', 'salaries', 'titles']

# Loop through the list of table names and fetch each table
for table_name in table_names:
    table_df = fetch_table(table_name)
    
    # Export the table as a CSV file
    table_df.to_csv(f'{table_name}.csv', index=False)

C:\Users\Administrator\AppData\Local\Programs\Python\Python310\lib\site-packages\pandas\io\sql.py:761: UserWarning: pandas only support SQLAlchemy connectable(engine/connection) ordatabase string URI or sqlite3 DBAPI2 connectionother DBAPI2 objects are not tested, please consider using SQLAlchemy
  warnings.warn(
C:\Users\Administrator\AppData\Local\Programs\Python\Python310\lib\site-packages\pandas\io\sql.py:761: UserWarning: pandas only support SQLAlchemy connectable(engine/connection) ordatabase string URI or sqlite3 DBAPI2 connectionother DBAPI2 objects are not tested, please consider using SQLAlchemy
  warnings.warn(
C:\Users\Administrator\AppData\Local\Programs\Python\Python310\lib\site-packages\pandas\io\sql.py:761: UserWarning: pandas only support SQLAlchemy connectable(engine/connection) ordatabase string URI or sqlite3 DBAPI2 connectionother DBAPI2 objects are not tested, please consider using SQLAlchemy
  warnings.warn(
C:\Users\Administrator\AppData\Local\Programs\Python\Python310\lib\site-packages\pandas\io\sql.py:761: UserWarning: pandas only support SQLAlchemy connectable(engine/connection) ordatabase string URI or sqlite3 DBAPI2 connectionother DBAPI2 objects are not tested, please consider using SQLAlchemy
  warnings.warn(
C:\Users\Administrator\AppData\Local\Programs\Python\Python310\lib\site-packages\pandas\io\sql.py:761: UserWarning: pandas only support SQLAlchemy connectable(engine/connection) ordatabase string URI or sqlite3 DBAPI2 connectionother DBAPI2 objects are not tested, please consider using SQLAlchemy
  warnings.warn(
C:\Users\Administrator\AppData\Local\Programs\Python\Python310\lib\site-packages\pandas\io\sql.py:761: UserWarning: pandas only support SQLAlchemy connectable(engine/connection) ordatabase string URI or sqlite3 DBAPI2 connectionother DBAPI2 objects are not tested, please consider using SQLAlchemy
  warnings.warn(

In [72]:
departments=pd.read_csv("departments.csv")
dept_emp=pd.read_csv("dept_emp.csv")
dept_manager=pd.read_csv("dept_manager.csv")
employees=pd.read_csv("employees.csv")
salaries=pd.read_csv("salaries.csv")
titles=pd.read_csv("titles.csv")

In [76]:
employees

        emp_no  birth_date first_name last_name gender   hire_date
0        10001  1953-09-02     Georgi   Facello      M  1986-06-26
1        10002  1964-06-02    Bezalel    Simmel      F  1985-11-21
2        10003  1959-12-03      Parto   Bamford      M  1986-08-28
3        10004  1954-05-01  Chirstian   Koblick      M  1986-12-01
4        10005  1955-01-21    Kyoichi  Maliniak      M  1989-09-12
...        ...         ...        ...       ...    ...         ...
300019  499995  1958-09-24     Dekang  Lichtner      F  1993-01-12
300020  499996  1953-03-07       Zito      Baaz      M  1990-09-27
300021  499997  1961-08-03    Berhard    Lenart      M  1986-04-21
300022  499998  1956-09-05   Patricia   Breugel      M  1993-10-13
300023  499999  1958-05-01     Sachin   Tsukuda      M  1997-11-30

[300024 rows x 6 columns]

![image.png]()

### Problem-13: Write an SQL query to return employees name getting top 3 salary for each department, along with their salaries, job titles, department and rank.

In [81]:
#WITH Window function

import pandas as pd
import pymysql

# establish a connection to the database
con = pymysql.connect(host='relational.fit.cvut.cz', port=3306, user='guest', password='relational', database='employee')

# define the SQL query
sql_query = """
SELECT dept_name, emp_title, emp_name, emp_salary, rank
FROM (
  SELECT d.dept_name, t.title AS emp_title, CONCAT(e.first_name, ' ', e.last_name) AS emp_name,
         s.salary AS emp_salary,
         DENSE_RANK() OVER (PARTITION BY d.dept_no ORDER BY s.salary DESC) AS rank
  FROM departments d
  JOIN dept_emp de ON de.dept_no = d.dept_no
  JOIN employees e ON e.emp_no = de.emp_no
  JOIN salaries s ON s.emp_no = e.emp_no
  JOIN titles t ON t.emp_no = e.emp_no
  WHERE t.to_date = '9999-01-01'
    AND s.to_date = '9999-01-01'
    AND de.to_date = '9999-01-01'
    AND d.dept_name IN ('Sales', 'Marketing', 'Finance')
) t
WHERE rank <= 3
ORDER BY dept_name ASC, rank ASC;

"""

# execute the query using pandas and the established connection
df = pd.read_sql_query(sql_query, con)

# print the resulting dataframe
print(df)

   dept_name     emp_title           emp_name  emp_salary  rank
0    Finance  Senior Staff       Lunjin Swick      142395     1
1    Finance  Senior Staff         Uta Lowrie      140742     2
2    Finance  Senior Staff      Genki Delaune      138775     3
3  Marketing  Senior Staff      Akemi Warwick      145128     1
4  Marketing  Senior Staff       Ingmar Isard      143644     2
5  Marketing  Senior Staff   Ortrud Diderrich      142506     3
6      Sales  Senior Staff     Tokuyasu Pesch      158220     1
7      Sales  Senior Staff  Honesty Mukaidono      156286     2
8      Sales  Senior Staff    Xiahua Whitcomb      155709     3

In [79]:
#WITHOUT Window function

import pandas as pd
import pymysql

# establish a connection to the database
con = pymysql.connect(host='relational.fit.cvut.cz', port=3306, user='guest', password='relational', database='employee')

# define the SQL query
sql_query = """
SELECT d.dept_name, e.first_name, e.last_name, s.salary, t.title, 
  (SELECT COUNT(DISTINCT s2.salary)
   FROM salaries s2
   WHERE s2.salary > s.salary AND s2.emp_no IN
     (SELECT dm.emp_no FROM dept_manager dm WHERE dm.dept_no = d.dept_no)) + 1 AS rank
FROM departments d
JOIN dept_emp de ON de.dept_no = d.dept_no
JOIN employees e ON e.emp_no = de.emp_no
JOIN salaries s ON s.emp_no = e.emp_no
JOIN titles t ON t.emp_no = e.emp_no
WHERE t.to_date = '9999-01-01'
  AND s.to_date = '9999-01-01'
  AND de.to_date = '9999-01-01'
  AND d.dept_name IN ('Sales', 'Marketing', 'Finance')
  AND (SELECT COUNT(DISTINCT s2.salary)
       FROM salaries s2
       WHERE s2.salary > s.salary AND s2.emp_no IN
         (SELECT dm.emp_no FROM dept_manager dm WHERE dm.dept_no = d.dept_no)) < 3
ORDER BY d.dept_name, s.salary DESC;
"""

# execute the query using pandas and the established connection
df = pd.read_sql_query(sql_query, con)

# print the resulting dataframe
print(df)

      dept_name first_name    last_name  salary         title  rank
0       Finance     Lunjin        Swick  142395  Senior Staff     1
1       Finance        Uta       Lowrie  140742  Senior Staff     1
2       Finance      Genki      Delaune  138775  Senior Staff     1
3       Finance     Waiman       Lodder  136978  Senior Staff     1
4       Finance   Tetsushi  Staylopatis  135857  Senior Staff     1
...         ...        ...          ...     ...           ...   ...
16199     Sales      Alain    Malabarba   99079  Senior Staff     3
16200     Sales  Cristinel      Szilard   99078  Senior Staff     3
16201     Sales       Hugo     Gyimothy   99078  Senior Staff     3
16202     Sales  Alejandro      Rullman   99077  Senior Staff     3
16203     Sales   Tomoyuki       Schade   99077  Senior Staff     3

[16204 rows x 6 columns]

### **Problem 14:** Write an SQL query to return the average salary of each department, along with the number of employees in each department and the department name. Rank the departments by average salary in descending order.

In [85]:
#WITH Window function
import pandas as pd
import pymysql

# establish a connection to the database
con = pymysql.connect(host='relational.fit.cvut.cz', port=3306, user='guest', password='relational', database='employee')

# define the SQL query
sql_query = """
SELECT DISTINCT
  d.dept_name,
  COUNT(*) OVER (PARTITION BY d.dept_no) AS num_employees,
  AVG(s.salary) OVER (PARTITION BY d.dept_no) AS avg_salary
FROM employees e
JOIN dept_emp de ON e.emp_no = de.emp_no
JOIN departments d ON de.dept_no = d.dept_no
JOIN salaries s ON e.emp_no = s.emp_no
WHERE s.to_date = '9999-01-01' AND de.to_date = '9999-01-01'
ORDER BY avg_salary DESC;

"""

# execute the query using pandas and the established connection
df = pd.read_sql_query(sql_query, con)

# print the resulting dataframe
print(df)

C:\Users\Administrator\AppData\Local\Programs\Python\Python310\lib\site-packages\pandas\io\sql.py:761: UserWarning: pandas only support SQLAlchemy connectable(engine/connection) ordatabase string URI or sqlite3 DBAPI2 connectionother DBAPI2 objects are not tested, please consider using SQLAlchemy
  warnings.warn(

            dept_name  num_employees  avg_salary
0               Sales          37701  88852.9695
1           Marketing          14842  80058.8488
2             Finance          12437  78559.9370
3            Research          15441  67913.3750
4          Production          53304  67843.3020
5         Development          61386  67657.9196
6    Customer Service          17569  67285.2302
7  Quality Management          14546  65441.9934
8     Human Resources          12898  63921.8998

In [83]:
#WITHOUT Window function
import pandas as pd
import pymysql

# establish a connection to the database
con = pymysql.connect(host='relational.fit.cvut.cz', port=3306, user='guest', password='relational', database='employee')

# define the SQL query
sql_query = """
SELECT employee.d.dept_name, AVG(salary) AS avg_salary, COUNT(*) AS num_employees
FROM employee.departments AS d
JOIN employee.dept_emp AS de ON de.dept_no = d.dept_no
JOIN employee.salaries AS s ON s.emp_no = de.emp_no
WHERE s.to_date = '9999-01-01' AND de.to_date = '9999-01-01'
GROUP BY employee.d.dept_name
ORDER BY avg_salary DESC;

"""

# execute the query using pandas and the established connection
df = pd.read_sql_query(sql_query, con)

# print the resulting dataframe
print(df)

            dept_name  avg_salary  num_employees
0               Sales  88852.9695          37701
1           Marketing  80058.8488          14842
2             Finance  78559.9370          12437
3            Research  67913.3750          15441
4          Production  67843.3020          53304
5         Development  67657.9196          61386
6    Customer Service  67285.2302          17569
7  Quality Management  65441.9934          14546
8     Human Resources  63921.8998          12898

### `Problem 15` Write an SQL query to return the current job title, current salary and join time title and salary for each employee along with name and employee number.

In [87]:
#WITH Window function
import pandas as pd
import pymysql

# establish a connection to the database
con = pymysql.connect(host='relational.fit.cvut.cz', port=3306, user='guest', password='relational', database='employee')

# define the SQL query
sql_query = """
SELECT e.emp_no, e.first_name, e.last_name,
  t.title,
  s.salary,
  t.from_date AS title_join_date,
  s.from_date AS salary_join_date,
  ROW_NUMBER() OVER(PARTITION BY e.emp_no ORDER BY t.to_date DESC, s.to_date DESC) AS rn
FROM employees e
JOIN titles t ON e.emp_no = t.emp_no
JOIN salaries s ON e.emp_no = s.emp_no
WHERE t.to_date = '9999-01-01'
  AND s.to_date = '9999-01-01'
ORDER BY e.emp_no, rn


"""

# execute the query using pandas and the established connection
df = pd.read_sql_query(sql_query, con)

# print the resulting dataframe
print(df)

C:\Users\Administrator\AppData\Local\Programs\Python\Python310\lib\site-packages\pandas\io\sql.py:761: UserWarning: pandas only support SQLAlchemy connectable(engine/connection) ordatabase string URI or sqlite3 DBAPI2 connectionother DBAPI2 objects are not tested, please consider using SQLAlchemy
  warnings.warn(

        emp_no first_name last_name            title  salary title_join_date  \
0        10001     Georgi   Facello  Senior Engineer   88958      1986-06-26
1        10002    Bezalel    Simmel            Staff   72527      1996-08-03
2        10003      Parto   Bamford  Senior Engineer   43311      1995-12-03
3        10004  Chirstian   Koblick  Senior Engineer   74057      1995-12-01
4        10005    Kyoichi  Maliniak     Senior Staff   94692      1996-09-12
...        ...        ...       ...              ...     ...             ...
240119  499995     Dekang  Lichtner         Engineer   52868      1997-06-02
240120  499996       Zito      Baaz  Senior Engineer   69501      2002-05-13
240121  499997    Berhard    Lenart  Senior Engineer   83441      1992-08-29
240122  499998   Patricia   Breugel     Senior Staff   55003      1998-12-27
240123  499999     Sachin   Tsukuda         Engineer   77303      1997-11-30

       salary_join_date  rn
0            2002-06-22   1
1            2001-08-02   1
2            2001-12-01   1
3            2001-11-27   1
4            2001-09-09   1
...                 ...  ..
240119       2002-06-01   1
240120       2002-05-12   1
240121       2001-08-26   1
240122       2001-12-25   1
240123       2001-11-29   1

[240124 rows x 8 columns]

In [86]:
#WITHOUT Window function
import pandas as pd
import pymysql

# establish a connection to the database
con = pymysql.connect(host='relational.fit.cvut.cz', port=3306, user='guest', password='relational', database='employee')

# define the SQL query
sql_query = """
SELECT e.emp_no, e.first_name, e.last_name, 
       t.title AS current_title, s.salary AS current_salary, 
       t.from_date AS join_title_date, s.from_date AS join_salary_date
FROM employees e
JOIN titles t ON e.emp_no = t.emp_no AND t.to_date = '9999-01-01'
JOIN salaries s ON e.emp_no = s.emp_no AND s.to_date = '9999-01-01'
ORDER BY e.emp_no;


"""

# execute the query using pandas and the established connection
df = pd.read_sql_query(sql_query, con)

# print the resulting dataframe
print(df)

C:\Users\Administrator\AppData\Local\Programs\Python\Python310\lib\site-packages\pandas\io\sql.py:761: UserWarning: pandas only support SQLAlchemy connectable(engine/connection) ordatabase string URI or sqlite3 DBAPI2 connectionother DBAPI2 objects are not tested, please consider using SQLAlchemy
  warnings.warn(

        emp_no first_name last_name    current_title  current_salary  \
0        10001     Georgi   Facello  Senior Engineer           88958
1        10002    Bezalel    Simmel            Staff           72527
2        10003      Parto   Bamford  Senior Engineer           43311
3        10004  Chirstian   Koblick  Senior Engineer           74057
4        10005    Kyoichi  Maliniak     Senior Staff           94692
...        ...        ...       ...              ...             ...
240119  499995     Dekang  Lichtner         Engineer           52868
240120  499996       Zito      Baaz  Senior Engineer           69501
240121  499997    Berhard    Lenart  Senior Engineer           83441
240122  499998   Patricia   Breugel     Senior Staff           55003
240123  499999     Sachin   Tsukuda         Engineer           77303

       join_title_date join_salary_date
0           1986-06-26       2002-06-22
1           1996-08-03       2001-08-02
2           1995-12-03       2001-12-01
3           1995-12-01       2001-11-27
4           1996-09-12       2001-09-09
...                ...              ...
240119      1997-06-02       2002-06-01
240120      2002-05-13       2002-05-12
240121      1992-08-29       2001-08-26
240122      1998-12-27       2001-12-25
240123      1997-11-30       2001-11-29

[240124 rows x 7 columns]